In [16]:
import pandas as pd 

df = pd.read_csv("csv/titanic.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [17]:
df.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

In [18]:
df.head()

   PassengerId  Survived  Pclass     Sex   Age     Fare
0            1         0       3    male  22.0   7.2500
1            2         1       1  female  38.0  71.2833
2            3         1       3  female  26.0   7.9250
3            4         1       1  female  35.0  53.1000
4            5         0       3    male  35.0   8.0500

In [19]:
target=df.Survived
inp = df.drop('Survived',axis='columns')

In [22]:
dum = pd.get_dummies(inp.Sex)
dum.head()
inp = pd.concat([inp,dum],axis='columns')
inp.drop('Sex',axis='columns',inplace=True)

AttributeError: 'DataFrame' object has no attribute 'Sex'

In [24]:
inp.head(3)

   PassengerId  Pclass   Age     Fare  female  male
0            1       3  22.0   7.2500       0     1
1            2       1  38.0  71.2833       1     0
2            3       3  26.0   7.9250       1     0

In [26]:
inp.columns[inp.isna().any()]

Index(['Age'], dtype='object')

In [34]:
inp.Age = inp.Age.fillna(inp.Age.mean())
inp.head()

   PassengerId  Pclass   Age     Fare  female  male
0            1       3  22.0   7.2500       0     1
1            2       1  38.0  71.2833       1     0
2            3       3  26.0   7.9250       1     0
3            4       1  35.0  53.1000       1     0
4            5       3  35.0   8.0500       0     1

In [68]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inp, target, test_size=0.2)

In [69]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train,y_train)
model.score(X_test,y_test)

0.7597765363128491

In [62]:
X_test.head()

     PassengerId  Pclass        Age   Fare  female  male
330          331       3  29.699118  23.25       1     0
241          242       3  29.699118  15.50       1     0
586          587       2  47.000000  15.00       0     1
792          793       3  29.699118  69.55       1     0
760          761       3  29.699118  14.50       0     1

In [65]:
X_test.head()

     PassengerId  Pclass        Age   Fare  female  male
330          331       3  29.699118  23.25       1     0
241          242       3  29.699118  15.50       1     0
586          587       2  47.000000  15.00       0     1
792          793       3  29.699118  69.55       1     0
760          761       3  29.699118  14.50       0     1

In [64]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 0, 0, 0, 0, 0, 0])

In [70]:
model.predict_proba(X_test)

array([[2.16470135e-02, 9.78352987e-01],
       [4.11418488e-02, 9.58858151e-01],
       [5.94567147e-02, 9.40543285e-01],
       [9.88602910e-01, 1.13970902e-02],
       [8.08504294e-01, 1.91495706e-01],
       [9.90613062e-01, 9.38693778e-03],
       [2.98598125e-70, 1.00000000e+00],
       [9.90656755e-01, 9.34324509e-03],
       [9.89430726e-01, 1.05692741e-02],
       [2.59748005e-01, 7.40251995e-01],
       [2.17936017e-02, 9.78206398e-01],
       [9.91367946e-01, 8.63205373e-03],
       [3.60251813e-02, 9.63974819e-01],
       [9.89405815e-01, 1.05941848e-02],
       [9.87069989e-01, 1.29300108e-02],
       [3.30150935e-02, 9.66984907e-01],
       [5.89960140e-02, 9.41003986e-01],
       [9.90744141e-01, 9.25585931e-03],
       [9.89907860e-01, 1.00921401e-02],
       [6.13792318e-02, 9.38620768e-01],
       [6.21524704e-02, 9.37847530e-01],
       [9.73958773e-01, 2.60412274e-02],
       [9.72387027e-01, 2.76129731e-02],
       [9.74957455e-01, 2.50425447e-02],
       [9.90250103e-01, 9.74989741e-03],
       [1.40708711e-19, 1.00000000e+00],
       [9.90492805e-01, 9.50719508e-03],
       [3.96615869e-01, 6.03384131e-01],
       [2.40006329e-02, 9.75999367e-01],
       [5.44983232e-04, 9.99455017e-01],
       [9.86779828e-01, 1.32201719e-02],
       [2.37387565e-02, 9.76261244e-01],
       [3.85953521e-04, 9.99614046e-01],
       [9.89084194e-01, 1.09158060e-02],
       [6.21270329e-02, 9.37872967e-01],
       [9.89000378e-01, 1.09996225e-02],
       [2.89923635e-02, 9.71007636e-01],
       [9.76445745e-01, 2.35542546e-02],
       [9.89893548e-01, 1.01064521e-02],
       [9.91110805e-01, 8.88919500e-03],
       [5.82603042e-02, 9.41739696e-01],
       [9.90706751e-01, 9.29324861e-03],
       [9.78523984e-01, 2.14760164e-02],
       [6.53839403e-02, 9.34616060e-01],
       [6.09440406e-02, 9.39055959e-01],
       [3.35299797e-03, 9.96647002e-01],
       [9.89519136e-01, 1.04808636e-02],
       [8.10263089e-01, 1.89736911e-01],
       [5.06888672e-01, 4.93111328e-01],
       [9.91721978e-01, 8.27802202e-03],
       [9.90589508e-01, 9.41049214e-03],
       [1.59167906e-16, 1.00000000e+00],
       [6.29098153e-02, 9.37090185e-01],
       [9.88467266e-01, 1.15327338e-02],
       [9.91741649e-01, 8.25835129e-03],
       [5.52089938e-02, 9.44791006e-01],
       [3.53064130e-04, 9.99646936e-01],
       [2.82585621e-03, 9.97174144e-01],
       [2.40627847e-05, 9.99975937e-01],
       [1.17327528e-02, 9.88267247e-01],
       [9.79335600e-01, 2.06644000e-02],
       [9.90096701e-01, 9.90329871e-03],
       [9.90118420e-01, 9.88157955e-03],
       [9.89816912e-01, 1.01830877e-02],
       [9.90323400e-01, 9.67659979e-03],
       [7.82462027e-07, 9.99999218e-01],
       [5.83823750e-02, 9.41617625e-01],
       [3.00595813e-02, 9.69940419e-01],
       [9.90786097e-01, 9.21390276e-03],
       [9.79079639e-03, 9.90209204e-01],
       [9.90944655e-01, 9.05534454e-03],
       [9.87682460e-01, 1.23175399e-02],
       [9.76812166e-01, 2.31878344e-02],
       [5.89611422e-02, 9.41038858e-01],
       [9.90475938e-01, 9.52406205e-03],
       [9.91064033e-01, 8.93596687e-03],
       [3.09742871e-02, 9.69025713e-01],
       [9.78022090e-01, 2.19779096e-02],
       [2.21333433e-04, 9.99778667e-01],
       [9.23743969e-01, 7.62560312e-02],
       [2.81323399e-02, 9.71867660e-01],
       [2.72536780e-02, 9.72746322e-01],
       [5.78408282e-12, 1.00000000e+00],
       [9.75265426e-01, 2.47345743e-02],
       [9.86862203e-01, 1.31377973e-02],
       [9.88541240e-01, 1.14587604e-02],
       [9.77768709e-01, 2.22312913e-02],
       [9.88481613e-01, 1.15183868e-02],
       [6.59303712e-02, 9.34069629e-01],
       [9.59838934e-01, 4.01610662e-02],
       [1.88681716e-14, 1.00000000e+00],
       [9.91490555e-01, 8.50944464e-03],
       [8.88418234e-01, 1.11581766e-01],
       [9.89010599e-01, 1.09894014e-02],
       [9.89823665e-01, 1.01763354e-02],
       [9.91528398e-01, 8.47160165e-03],
       [9.89042606e-01, 1.09573943e-02],
       [9.89033528e-01, 1.09664721e-02],
       [6.10538916e-02, 9.38946108e-01],
       [5.35355105e-09, 9.99999995e-01],
       [9.86012832e-01, 1.39871675e-02],
       [6.26219093e-02, 9.37378091e-01],
       [6.23221527e-03, 9.93767785e-01],
       [9.91691508e-01, 8.30849157e-03],
       [9.21403592e-01, 7.85964084e-02],
       [5.55178155e-02, 9.44482184e-01],
       [5.75775563e-02, 9.42422444e-01],
       [6.17730688e-02, 9.38226931e-01],
       [8.38934099e-01, 1.61065901e-01],
       [9.81991427e-01, 1.80085728e-02],
       [9.90822226e-01, 9.17777444e-03],
       [9.76649682e-01, 2.33503177e-02],
       [9.90127673e-01, 9.87232678e-03],
       [9.91309215e-01, 8.69078541e-03],
       [8.99242999e-01, 1.00757001e-01],
       [6.43908486e-02, 9.35609151e-01],
       [9.89015025e-01, 1.09849747e-02],
       [4.48643172e-02, 9.55135683e-01],
       [9.75891635e-01, 2.41083645e-02],
       [9.89274545e-01, 1.07254552e-02],
       [7.08294447e-03, 9.92917056e-01],
       [6.52549534e-02, 9.34745047e-01],
       [9.91154375e-01, 8.84562545e-03],
       [9.54703351e-01, 4.52966486e-02],
       [2.33240156e-03, 9.97667598e-01],
       [9.79251422e-01, 2.07485778e-02],
       [9.75800555e-01, 2.41994449e-02],
       [8.05441431e-01, 1.94558569e-01],
       [9.76219604e-01, 2.37803962e-02],
       [2.51026107e-01, 7.48973893e-01],
       [9.90299911e-01, 9.70008934e-03],
       [8.11238439e-06, 9.99991888e-01],
       [4.39553094e-02, 9.56044691e-01],
       [9.79359075e-01, 2.06409247e-02],
       [6.17455347e-02, 9.38254465e-01],
       [4.40272014e-01, 5.59727986e-01],
       [9.78360490e-01, 2.16395104e-02],
       [8.06116382e-01, 1.93883618e-01],
       [9.90333070e-01, 9.66693038e-03],
       [6.20218104e-02, 9.37978190e-01],
       [9.79290605e-01, 2.07093953e-02],
       [9.90330437e-01, 9.66956295e-03],
       [5.57605661e-02, 9.44239434e-01],
       [1.07544090e-19, 1.00000000e+00],
       [9.88817196e-01, 1.11828042e-02],
       [9.13282403e-01, 8.67175970e-02],
       [2.67728903e-02, 9.73227110e-01],
       [9.91547596e-01, 8.45240389e-03],
       [2.30986098e-02, 9.76901390e-01],
       [5.93968383e-02, 9.40603162e-01],
       [9.91551530e-01, 8.44846968e-03],
       [9.78852932e-01, 2.11470684e-02],
       [2.94209862e-02, 9.70579014e-01],
       [9.89566266e-01, 1.04337344e-02],
       [9.50522977e-01, 4.94770232e-02],
       [9.90128710e-01, 9.87128974e-03],
       [9.90875142e-01, 9.12485762e-03],
       [6.30775560e-01, 3.69224440e-01],
       [8.98467842e-01, 1.01532158e-01],
       [9.91286223e-01, 8.71377739e-03],
       [8.31418372e-01, 1.68581628e-01],
       [5.94266271e-02, 9.40573373e-01],
       [2.82532741e-02, 9.71746726e-01],
       [1.23357054e-16, 1.00000000e+00],
       [3.95279881e-01, 6.04720119e-01],
       [9.92249478e-01, 7.75052195e-03],
       [9.90696493e-01, 9.30350712e-03],
       [5.39852776e-67, 1.00000000e+00],
       [3.53469210e-02, 9.64653079e-01],
       [9.89419606e-01, 1.05803945e-02],
       [8.77038110e-01, 1.22961890e-01],
       [9.78245146e-01, 2.17548539e-02],
       [9.91048819e-01, 8.95118129e-03],
       [4.69697006e-02, 9.53030299e-01],
       [6.63323858e-02, 9.33667614e-01],
       [9.90400224e-01, 9.59977555e-03],
       [9.76206593e-01, 2.37934068e-02],
       [9.74549641e-01, 2.54503588e-02],
       [9.78479969e-01, 2.15200310e-02]])

In [253]:
df = pd.read_csv('csv/spam.csv')
df.head()

  Category                                            Message
0      ham  Go until jurong point, crazy.. Available only ...
1      ham                      Ok lar... Joking wif u oni...
2     spam  Free entry in 2 a wkly comp to win FA Cup fina...
3      ham  U dun say so early hor... U c already then say...
4      ham  Nah I don't think he goes to usf, he lives aro...

In [254]:
df.groupby('Category').describe()

         Message                                                            \
           count unique                                                top
Category
ham         4825   4516                             Sorry, I'll call later
spam         747    641  Please call our customer service representativ...


         freq
Category
ham        30
spam        4

In [255]:
df['spam'] = df['Category'].apply(lambda x: 1 if x == 'spam' else 0)

In [256]:
df.drop('Category',axis='columns',inplace = True)

In [257]:
df.head(3)

                                             Message  spam
0  Go until jurong point, crazy.. Available only ...     0
1                      Ok lar... Joking wif u oni...     0
2  Free entry in 2 a wkly comp to win FA Cup fina...     1

In [258]:
from sklearn.model_selection import train_test_split

X_train,X_test,y_train,y_test = train_test_split(df.Message,df.spam,test_size=0.25)

In [259]:
# данная хуйня берет слова которые повторяются бОльшее кол-во раз. 
from sklearn.feature_extraction.text import CountVectorizer

vect = CountVectorizer()

In [260]:
# помещаем значения обучающей выборки в модель после чего трансформируем его в вектора

X_train_count = vect.fit_transform(X_train.values)
X_train_count.toarray()[:3]

array([[0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0],
       [0, 0, 0, ..., 0, 0, 0]])

In [261]:
from sklearn.naive_bayes import MultinomialNB
model = MultinomialNB()
model.fit(X_train_count,y_train)

MultinomialNB()

In [262]:
emails = [
    'Hey dude whatsupp how are u doing',
    'Upto 20% discount in our store ! weekends are free food. join to our partnership'
]
email_count = vect.transform(emails)
model.predict(email_count)

array([0, 1])

In [263]:
x_test_count = vect.transform(X_test.values)
model.score(x_test_count, y_test)

0.9863603732950467

In [266]:
from sklearn.pipeline import Pipeline

clf=Pipeline([
    ('vectorizer', CountVectorizer()),
    ('nb', MultinomialNB())
])

In [270]:
clf.fit(X_train, y_train)

2229                       Those were my exact intentions
4769           I'm not sure if its still available though
177                            U still going to the mall?
965                                Are you this much buzy
5211                      It is only yesterday true true.
                              ...
1629            Yes princess! I want to make you happy...
3874    Happy or sad , one thing about past is- "Its n...
5230                        Nope, I'm still in the market
879     U have a secret admirer who is looking 2 make ...
2077            Trust me. Even if isn't there, its there.
Name: Message, Length: 1393, dtype: object

In [272]:
clf.score(X_test,y_test)

0.9863603732950467

In [281]:
from sklearn import datasets
wine = datasets.load_wine()
df = pd.DataFrame(wine.data, columns=wine.feature_names)
df['target'] = wine.target

In [288]:
X_train, X_test, y_train, y_test = train_test_split(df.drop('target',axis='columns'),df.target,test_size=0.3)
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB()

In [292]:
X_test.head(5)

,alcohol,malic_acid,ash,alcalinity_of_ash,magnesium,total_phenols,flavanoids,nonflavanoid_phenols,proanthocyanins,color_intensity,hue,od280/od315_of_diluted_wines,proline
122,12.42,4.43,2.73,26.5,102.0,2.20,2.13,0.43,1.71,2.08,0.92,3.12,365.0
3,14.37,1.95,2.50,16.8,113.0,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480.0
118,12.77,3.43,1.98,16.0,80.0,1.63,1.25,0.43,0.83,3.40,0.70,2.12,372.0
113,11.41,0.74,2.50,21.0,88.0,2.48,2.01,0.42,1.44,3.08,1.10,2.31,434.0
141,13.36,2.56,2.35,20.0,89.0,1.40,0.50,0.37,0.64,5.60,0.70,2.47,780.0

In [293]:
model.predict(X_test)

array([1, 0, 1, 1, 2, 1, 0, 0, 2, 0, 1, 0, 2, 1, 2, 0, 0, 1, 2, 0, 1, 0,
       0, 2, 2, 1, 1, 2, 1, 1, 1, 2, 2, 1, 2, 0, 1, 0, 0, 0, 1, 0, 0, 1,
       1, 1, 0, 1, 0, 1, 0, 1, 1, 2])

In [289]:
model.score(X_test, y_test)

0.9814814814814815

In [286]:
model = MultinomialNB()
model.fit(X_train, y_train)

MultinomialNB()

In [287]:
model.score(X_test, y_test)

0.7777777777777778

In [11]:
import pandas as pd 

df = pd.read_csv("csv/titanic.csv")
df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [12]:
# df.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked','Fare','Pclass'],axis='columns')
df['se_x'] = df.apply()

     PassengerId  Survived     Sex   Age
0              1         0    male  22.0
1              2         1  female  38.0
2              3         1  female  26.0
3              4         1  female  35.0
4              5         0    male  35.0
..           ...       ...     ...   ...
886          887         0    male  27.0
887          888         1  female  19.0
888          889         0  female   NaN
889          890         1    male  26.0
890          891         0    male  32.0

[891 rows x 4 columns]